README.md
```mermaid

erDiagram

  STATE {
    STRING name
  }
  STATE ||--|{ CITY : "contains"

  CITY {
    STRING name
  }

  CITIZEN {
    STRING cpf_number
    STRING name
    %% May be "MASCULINE", "FEMININE", or "NEUTRAL"
    STRING gender
    LOCAL_DATE birth_date
  }
  CITIZEN }o--|| CITY : "born in"
  CITIZEN }o--|| POLLING_STATION : "registered in"
  CITIZEN ||--o| ATTENDED : ""

  ATTENDED {
    LOCAL_DATETIME time
  }
  ATTENDED }o--|| POLLING_STATION : ""

  POLLING_STATION {
    STRING name
  }
  CITY ||--|{ POLLING_STATION : "contains"

  MACHINE {
    STRING serial_number
  }

  USE {
    LOCAL_DATETIME start_time
    LOCAL_DATETIME end_time
    String status
  }
  POLLING_STATION ||--|{ USE : "uses"
  MACHINE ||--o| USE : "is used by"

  CANDIDATE {
    STRING party
  }
  CANDIDATE |o..|| CITIZEN : "is"

  VOTE {
  }
  MACHINE ||--o{ VOTE : "casts"
  CANDIDATE ||--o{ VOTE : "receives"

```
